task/single-software/cli/openfoam/task-20/init_file/dynamic_base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          35;
        startFace       3485;
    }
    right
    {
        type            patch;
        nFaces          35;
        startFace       3520;
    }
    down
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3555;
    }
    up
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       3595;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       3635;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       3715;
    }
)

// ************************************************************************* //
