task/single-software/cli/openfoam/task-20/init_file/dynamic_base/constant/dynamicMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object dynamicMeshDict;
}

dynamicFvMesh   dynamicMotionSolverFvMesh;
motionSolverLibs ("libfvMotionSolvers.so");
motionSolver    solidBody;

solidBodyMotionFunction oscillatingRotatingMotion;
origin          (0.5 0.25 0); // TODO_ROTATION_ORIGIN
amplitude       (0 0 5); // TODO_AMPLITUDE_DEG
omega           6.283185307; // TODO_ANGULAR_FREQUENCY (2*pi*Hz)
