task/single-software/cli/openfoam/task-20/init_file/dynamic_base/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 0.01;
